// bry/bry.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    bry_url: [
      {
        url: 'http://chuantu.biz/t6/351/1533124813x-1566688269.jpg',
        id: 0
      },
      {
        url: 'http://chuantu.biz/t6/351/1533124869x-1404755576.jpg',
        id: 1
      },
      {
        url: 'http://chuantu.biz/t6/351/1533125040x-1566688556.jpg',
        id: 2
      },
      {
        url: 'http://chuantu.biz/t6/351/1533125099x1822611413.jpg',
        id: 3
      }
    ],
    wx_m:'http://chuantu.biz/t6/351/1533084043x-1404755445.png',
    bry_list: [
      {
        tit: '白人岩攻略·景点简介',
        txt: [
          '白人岩亦称“白仁岩”，坐落在历史文化名城山西省代县古城西北，东邻雁门关西陉口，北倚恒山，海拔2228米。因有白谷仙人坐化成峰，峰顶巨石为颅，飘然独立而得名，建寺时间约为公元354—365年。',
          '门票价格:不止没有门票，每年都有几次庙会，山上素斋据说很好吃哦。'
        ],
        id: 0
      },
      {
        tit: '白人岩攻略·适合人群',
        txt: [
          '1、佛教信徒|爱好者，白人岩净土祖庭之一，更是地处代州这种村村有庙的地方，其佛教氛围以及在周边寺庙中的地位都不容小窥',
          '2、登山爱好者，白人岩景区全部是徒步爬山的路，却风景甚好，绝对是个登山的好去处',
        ],
        id: 1
      },
      {
        tit: '白人岩攻略·出行方式',
        txt: [
          '1、自驾游，白人岩地处代县城西北，从大运高速【二广高速】代县口下高速，上山更快捷，路上有表示路牌，不是很推荐从其他高速口下车',
          '2、跟团游，目前为止山西各地及代县城内日常均无该线路，可提前问询县城旅行社，若有则可跟团',
          '3、朋友结伴或火车汽车等自由行,可先行到县城进行租车，再上山'
        ],
        id: 2
      },
      {
        tit: '白人岩攻略·周边常规路线',
        txt: [
          '1、代县游，一日内，雁门关+杨忠武祠，或雁门关+代州古城。两日内，雁门关+白人岩+赵杲观+代州古城+杨忠武祠',
          '2、忻州游，一日内，原平天涯山+雁门关，二到五日，禹王洞+原平天涯山+雁门关+五台山+河边民俗馆【阎锡山故居】',
          '3、晋北宗教古建游，三到五日，雁门关+五台山+应县木塔+恒山+云冈石窟'
        ],
        id: 3
      }, {
        tit: '白人岩攻略·注意事项',
        txt: [
          '1、白人岩地势较高，请考虑自身身体原因再进行选择是否游玩',
          '2、最好夏秋两季上山，天气较好，且更加安全',
          '3、宗教场所，请谨言慎行'
        ],
      }
    ],
    indicatorDots: true,
    autoplay: true,
    interval: 5000,
    duration: 1000
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  },
  previewImage: function (e) {
    wx.previewImage({
      urls: this.data.wx_m.split(',')
      // 需要预览的图片http链接  使用split把字符串转数组。不然会报错
    })
  }
})